Sandman6z/STM32_Demo/stm32_DHT11_[aosong]/user/ili9320.c
  b = (c>>0)  & 0x1f;
  g = (c>>5)  & 0x3f;
  r = (c>>11) & 0x1f;
  
  rgb =  (b<<11) + (g<<5) + (r<<0);

  return( rgb );
}

/****************************************************************************
* 名    称：void ili9320_BackLight(u8 status)
* 功    能：开、关液晶背光
* 入口参数：status     1:背光开  0:背光关
* 出口参数：无
* 说    明：
* 调用方法：ili9320_BackLight(1);
****************************************************************************/
void ili9320_BackLight(u8 status)
{
  if ( status >= 1 )
  {
    Lcd_Light_ON;
  }
  else
  {
    Lcd_Light_OFF;
  }
}

/****************************************************************************
* 名    称：void ili9320_Delay(vu32 nCount)
* 功    能：延时
* 入口参数：nCount   延时值
* 出口参数：无
* 说    明：
* 调用方法：ili9320_Delay(10000);
****************************************************************************/
void ili9320_Delay(vu32 nCount)
{
   Delay(nCount);
  //for(; nCount != 0; nCount--);
}

/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawChar24_48(uint16_t Xpos, uint16_t Ypos, const uint8_t *cpFontArray)
{
    uint32_t index = 0, i = 0, j = 0, k = 0, y;
    uint8_t Xaddress = 0;
/**************** Armjishu.com Add { *************************************/
	uint32_t  Width = 24;
	uint32_t  Height = 48;
//	uint32_t  BytesPreChar = 144;
/**************** Armjishu.com Add } *************************************/	 
    Xaddress = Xpos;

    ili9320_SetCursor(Xaddress, Ypos);

    for(y = 0; y < Height; y++)
    {
        LCD_WriteRAM_Prepare(); 
        for(i = Width; i > 0;)
        {
            if(i>=8)
            {
                k = 8;
            }
            else
            {
                k = i;
            }

            for(j = 0; j < k; j++)
            {
                if((cpFontArray[index] & (0x80 >> j)) == 0x00)
                {
                    if(HyalineBack == HyalineBackDis)
                    {
                        LCD_WriteRAM(BackColor); //putchar(' ');
                    }
                    else
                    {
                        ili9320_SetCursor(Xaddress, Ypos+(Width - i)+1);
                        LCD_WriteRAM_Prepare();
                    }
                }
                else
                {
                    LCD_WriteRAM(TextColor); //putchar('*');
                }
                i--;
                //Delay(2);//此处加延迟可以清楚的看到组成字符的一个个的点绘制过程
            }
            index++;
        }   
        SetCs
        Xaddress++;
        ili9320_SetCursor(Xaddress, Ypos);
    }
    //putchar('\r');putchar('\n');
}
						 //======================================================================
void LCD_DrawChar48_48(uint16_t Xpos, uint16_t Ypos, const uint8_t *cpFontArray)
{
    uint32_t index = 0, i = 0, j = 0, k = 0, y;
    uint8_t Xaddress = 0;
/**************** Armjishu.com Add { *************************************/
	uint32_t  Width = 48;
	uint32_t  Height = 48;
//	uint32_t  BytesPreChar = 144;
/**************** Armjishu.com Add } *************************************/	 
    Xaddress = Xpos;

    ili9320_SetCursor(Xaddress, Ypos);

    for(y = 0; y < Height; y++)
    {
        LCD_WriteRAM_Prepare(); 
        for(i = Width; i > 0;)
        {
            if(i>=8)
            {
                k = 8;
            }
            else
            {
                k = i;
            }

            for(j = 0; j < k; j++)
            {
                if((cpFontArray[index] & (0x80 >> j)) == 0x00)
                {
                    if(HyalineBack == HyalineBackDis)
                    {
                        LCD_WriteRAM(BackColor); //putchar(' ');
                    }
                    else
                    {
                        ili9320_SetCursor(Xaddress, Ypos+(Width - i)+1);
                        LCD_WriteRAM_Prepare();
                    }
                }
                else
                {
                    LCD_WriteRAM(TextColor); //putchar('*');
                }
                i--;
                //Delay(2);//此处加延迟可以清楚的看到组成字符的一个个的点绘制过程
            }
            index++;
        }   
        SetCs
        Xaddress++;ili9320_SetCursor(Xaddress, Ypos);
		}
}

//自己增添侠显示函数
void jiemian()
{
   //温度显示
	LCD_DrawChar48_48(0,239- 0*48, &fuhao[2*288]);
	LCD_DrawChar48_48(0,239- 1*48, &fuhao[3*288]);
	LCD_DrawChar24_48(0,239- 2*48, &ASCII_Table[10*144]);
	LCD_DrawChar48_48(0,239- 3.5*48, &fuhao[0*288]);
//	displayshuzi(0,56);
  //湿度显示
	LCD_DrawChar48_48(48,239- 0*48, &fuhao[4*288]);
	LCD_DrawChar48_48(48,239- 1*48, &fuhao[3*288]);
	LCD_DrawChar24_48(48,239- 2*48, &ASCII_Table[10*144]);
	LCD_DrawChar48_48(48,239-3.5*48, &fuhao[1*288]);
//	displayshuzi(48,78);
}
void displayshuzi(char line,int nub)
{
  int nub1=0,nub2=0;
  nub1=nub/10;
  nub2=nub%10;
  LCD_DrawChar24_48(line,239- (48+48+24), &ASCII_Table[(nub1)*144]);
  LCD_DrawChar24_48(line,239- (48+48+24+24),&ASCII_Table[(nub2)*144]);
  //LCD_DrawChar48_48(0,239- 3*24, &fuhao[0*288]);

  //温度显示
 //	 LCD_DrawChar48_48(0,239- 0*48, &fuhao[2*288]);
 //	 LCD_DrawChar48_48(0,239- 1*48, &fuhao[3*288]);
 //	 LCD_DrawChar24_48(0,239- 2*48, &ASCII_Table[10*144]);
 	 
  //湿度显示
//  	 LCD_DrawChar48_48(48,239- 0*48, &fuhao[4*288]);
 //	 LCD_DrawChar48_48(48,239- 1*48, &fuhao[3*288]);
 // 	LCD_DrawChar24_48(48,239- 2*48, &ASCII_Table[10*144]);

}

void display(int wendu,int shidu)
{
		 displayshuzi(0,wendu);
		 displayshuzi(48,shidu);
}